"""
1자리 -> 1~9 : 9개
2자리 -> (10,12), (21,23), (32,34), 45, 56, 67, 78, 89) 98 -> 17
3자리 -> (101, 123, 121) (210, 212, 232, 234) (321,323,343,345)
         (876,878,898) (987,989) -> 1,8,9자리 : 7개 2~7 : 4개 -> 31
4자리 -> (1010,1012, 1210,1212, 1232,1234)
"""

n = int(input())

dp = [[0] * 10 for _ in range(n+1)] # dp[자리수][가장 뒤에 오는 숫자]

for i in range(1,10):
    dp[1][i] = 1

for i in range(2, n+1):
    for j in range(10):
        
        if j==0: # 가장 뒤에 오는 숫자가 0일 때, 그 앞에 1만 올 수 있다.
            dp[i][j] = dp[i-1][1]
        
        elif 1 <= j <= 8:
            dp[i][j] = dp[i-1][j-1] + dp[i-1][j+1]
        
        else: # 9일때
            dp[i][j] = dp[i-1][8]

print(sum(dp[n]) % 1000000000)

